---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CurveLoop Properties
CurveLoop Class See Also Send Feedback
---

The CurveLoop type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

CurveLoop Class

Autodesk.Revit.DB Namespace